function loadGrain(levels) {
    let totalGraine = 0;

    levels.forEach((level, index) => {
        console.log(`levels ${level} is at index ${index}`);
        let grainOnLevel = 0;
        if (level > grainOnLevel) {

        }
    });

    return 0;
}

loadGrain([2, 1, 5, 2, 7, 4, 10])


'Як реалізувати я не знаю. Можливо якби, було б більше часу подумати я б зробив
    '1. На мою думку треба значення записувати в змінну потім порівнювати з наступним значенням. якщо друге значення ' +
    'буде менше перщого значення то треба записати висоту рівня від якого рахувати кількість одиниць зерна у висоту. ' +
    'це різниця мі першим та другим.  зерна. потім порівнюється значення наступне з першим та другим. якщо менше' +
    ' першого, то одразу записується одиниця зерна, якщо дорівнює першому то ще одиниця. якщо більше першого то далі ' +
    'порівняння почнеться з цього значення більше першого то запис плюс 1 одиницю зерна. якщо більше 2 то ще плюс один'
